# -----------------------------------------------------------------------------
# GIBBS SAMPLING
# Econometrics IV, Part 1
# Prof. Frank Schorfheide
#
# -----------------------------------------------------------------------------

module GS

export gibbs

# ---------
# Packages
# ---------
using Distributions, Random


function gibbs(μ_1::Real, σ_1::Real, μ_2::Real, σ_2::Real, ρ::Real, Y2_ini::Real)

    # -------------
    # 1.  Y1 | Y2
    # -------------
    μ_12 = μ_1 + ρ * (σ_1/σ_2) * (Y2_ini - μ_2)
    σ_12 = σ_1 * sqrt(1-ρ^2)
    d_12 = Normal(μ_12, sqrt(σ_12))

    # -------------------------
    # 2. Drawing from Y1 | Y2
    # --------------------------
    Y1 = rand(d_12, 1)[1]

    # ------------
    # 3.  Y2 | Y1
    # ------------
    μ_21 = μ_2 + ρ * (σ_2/σ_1) * (Y1 - μ_1)
    σ_21 = σ_2 * sqrt(1-ρ^2)
    d_21 = Normal(μ_21, sqrt(σ_21))

    # ------------------------
    # 4. Drawing from Y2 | Y1
    # -------------------------
    Y2 = rand(d_21, 1)[1]


    return Y1, Y2

end


end
